## 3-10. 자료형 변환, 산술 연산

In [1]:
import pandas as pd

In [23]:
df = pd.read_csv('kpop_idols.csv')
df

,Profile,Stage Name,Full Name,Korean Name,K. Stage Name,Date of Birth,Group,Country,Second Country,Height,Weight,Birthplace,Other Group,Former Group,Gender,Position,Instagram,Twitter
0,Profile,Taeyeon,Kim Taeyeon,김태연,태연,1989-03-09,SNSD,South Korea,NaN,160,44,Jeonju,"TTS, Oh!GG",NaN,F,"Leader, Main Vocalist",taeyeon_ss,NaN
1,NaN,Sunny,Lee Sunkyu,이순규,써니,1989-05-15,SNSD,South Korea,NaN,158,43,California,NaN,NaN,F,NaN,svnnynight,NaN
2,NaN,Tiffany,Hwang Miyoung,황미영,티파니,1989-08-01,SNSD,South Korea,USA,163,50,San Francisco,TTS,NaN,F,NaN,xolovestephi,NaN
3,NaN,Hyoyeon,Kim Hyoyeon,김효연,효연,1989-09-22,SNSD,South Korea,NaN,158,48,Incheon,NaN,NaN,F,NaN,watasiwahyo,NaN
4,NaN,Yuri,Kwon Yuri,권유리,유리,1989-12-05,SNSD,South Korea,NaN,167,45,Goyang,NaN,NaN,F,NaN,yulyulk,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1589,NaN,Ririka,Kishida Ririka,키시다 리리카,리리카,2002-07-02,ILY:1,Japan,NaN,162,0,NaN,NaN,NaN,F,NaN,NaN,NaN
1590,NaN,Nayu,Kim Yewon,김예원,나유,2002-07-23,ILY:1,South Korea,NaN,0,0,NaN,NaN,NaN,F,NaN,NaN,NaN
1591,NaN,Elva,Lee Yonghwa,이용화,엘바,2003-05-05,ILY:1,South Korea,NaN,0,0,NaN,NaN,NaN,F,NaN,NaN,NaN
1592,NaN,Lily,Lily Jin Morrow,릴리 진 머로우,릴리,2002-10-17,NMIXX,Australia,South Korea,0,0,Marysville,NaN,NaN,F,NaN,NaN,NaN
1593,NaN,Haewon,Oh Haewon,오해원,해원,2003-02-25,NMIXX,South Korea,NaN,0,0,NaN,NaN,NaN,F,NaN,NaN,NaN

In [24]:
df = df.iloc[:7,1:11]
df = df[['Korean Name', 'Date of Birth', 'Height', 'Weight']] 
df

  Korean Name Date of Birth  Height  Weight
0         김태연    1989-03-09     160      44
1         이순규    1989-05-15     158      43
2         황미영    1989-08-01     163      50
3         김효연    1989-09-22     158      48
4         권유리    1989-12-05     167      45
5         최수영    1990-02-10     170      48
6         임윤아    1990-05-30     166      47

### 3-10-1. 자료형 변환

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Korean Name    7 non-null      object
 1   Date of Birth  7 non-null      object
 2   Height         7 non-null      int64
 3   Weight         7 non-null      int64
dtypes: int64(2), object(2)
memory usage: 356.0+ bytes

1. int -> str 변환 : astype('str')

In [5]:
df['Height'] = df['Height'].astype('str')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Korean Name    7 non-null      object
 1   Date of Birth  7 non-null      object
 2   Height         7 non-null      object
 3   Weight         7 non-null      int64
dtypes: int64(1), object(3)
memory usage: 356.0+ bytes

2. str -> int 타입 변환 (`astype('int')`)

In [6]:
df['Height'] = df['Height'].astype('int')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Korean Name    7 non-null      object
 1   Date of Birth  7 non-null      object
 2   Height         7 non-null      int64
 3   Weight         7 non-null      int64
dtypes: int64(2), object(2)
memory usage: 356.0+ bytes

3. str -> datetime 타입으로 변환 : pd.to_datetime(df['컬럼명'])

In [7]:
df['Date of Birth'][0]

'1989-03-09'

In [27]:
df['Date of Birth'] = pd.to_datetime(df['Date of Birth'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Korean Name    7 non-null      object
 1   Date of Birth  7 non-null      datetime64[ns]
 2   Height         7 non-null      int64
 3   Weight         7 non-null      int64
dtypes: datetime64[ns](1), int64(2), object(1)
memory usage: 356.0+ bytes

In [9]:
df['Date of Birth'][0]

Timestamp('1989-03-09 00:00:00')

### 3-2. datetime 타입으로 날짜 슬라이싱 : dt 속성 사용

In [10]:
df['Date of Birth']

0   1989-03-09
1   1989-05-15
2   1989-08-01
3   1989-09-22
4   1989-12-05
5   1990-02-10
6   1990-05-30
Name: Date of Birth, dtype: datetime64[ns]

In [ ]:
# 연도 추출

df['Date of Birth'].dt.year

0    1989
1    1989
2    1989
3    1989
4    1989
5    1990
6    1990
Name: Date of Birth, dtype: int32

In [12]:
# 월 추출

df['Date of Birth'].dt.month

0     3
1     5
2     8
3     9
4    12
5     2
6     5
Name: Date of Birth, dtype: int32

In [13]:
# 일 추출

df['Date of Birth'].dt.day

0     9
1    15
2     1
3    22
4     5
5    10
6    30
Name: Date of Birth, dtype: int32

In [28]:
# 데이터 프레임에 날짜 슬라이싱한 열 추가
df['Year of Birth'] = df['Date of Birth'].dt.year
df['Month of Birth'] = df['Date of Birth'].dt.month
df['Day of Birth'] = df['Date of Birth'].dt.day

df

,Korean Name,Date of Birth,Height,Weight,Year of Birth,Month of Birth,Day of Birth
0,김태연,1989-03-09,160,44,1989,3,9
1,이순규,1989-05-15,158,43,1989,5,15
2,황미영,1989-08-01,163,50,1989,8,1
3,김효연,1989-09-22,158,48,1989,9,22
4,권유리,1989-12-05,167,45,1989,12,5
5,최수영,1990-02-10,170,48,1990,2,10
6,임윤아,1990-05-30,166,47,1990,5,30

### 3-10-2. 산술 연산 : 데이터 타입이 같은 경우만 연산 가능

In [16]:
# 사칙 연산

df['Height'] + df['Weight']

0    204
1    201
2    213
3    206
4    212
5    218
6    213
dtype: int64

In [17]:
df['Height'] - df['Weight']

0    116
1    115
2    113
3    110
4    122
5    122
6    119
dtype: int64

In [18]:
df['Height'] * df['Weight']

0    7040
1    6794
2    8150
3    7584
4    7515
5    8160
6    7802
dtype: int64

In [19]:
df['Height'] / df['Weight']

0    3.636364
1    3.674419
2    3.260000
3    3.291667
4    3.711111
5    3.541667
6    3.531915
dtype: float64

데이트타임 연산

In [30]:
df

,Korean Name,Date of Birth,Height,Weight,Year of Birth,Month of Birth,Day of Birth
0,김태연,1989-03-09,160,44,1989,3,9
1,이순규,1989-05-15,158,43,1989,5,15
2,황미영,1989-08-01,163,50,1989,8,1
3,김효연,1989-09-22,158,48,1989,9,22
4,권유리,1989-12-05,167,45,1989,12,5
5,최수영,1990-02-10,170,48,1990,2,10
6,임윤아,1990-05-30,166,47,1990,5,30

In [31]:
df['Date of Birth'] + df['Day of Birth']

TypeError: Addition/subtraction of integers and integer-arrays with DatetimeArray is no longer supported.  Instead of adding/subtracting `n`, use `n * obj.freq`

In [33]:
# pd.Timedelta 자료형으로 변환 : to_timedelta

df['Day of Birth'] = pd.to_timedelta(df['Day of Birth'], unit ='day')

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Korean Name     7 non-null      object
 1   Date of Birth   7 non-null      datetime64[ns]
 2   Height          7 non-null      int64
 3   Weight          7 non-null      int64
 4   Year of Birth   7 non-null      int32
 5   Month of Birth  7 non-null      int32
 6   Day of Birth    7 non-null      timedelta64[ns]
dtypes: datetime64[ns](1), int32(2), int64(2), object(1), timedelta64[ns](1)
memory usage: 468.0+ bytes

In [35]:
df['Date of Birth'] +  df['Day of Birth']

0   1989-03-18
1   1989-05-30
2   1989-08-02
3   1989-10-14
4   1989-12-10
5   1990-02-20
6   1990-06-29
dtype: datetime64[ns]

### 통계 연산

In [36]:
df = pd.DataFrame({'국어': [100, 60, 50, 75], '수학': [80, 70, 65, 90], '영어': [90, 55, 85, 70]})
df

    국어  수학  영어
0  100  80  90
1   60  70  55
2   50  65  85
3   75  90  70

In [37]:
# 행 합계
df.sum(axis=0)

국어    285
수학    305
영어    300
dtype: int64

In [38]:
# 행 평균
df.mean(axis=0)

국어    71.25
수학    76.25
영어    75.00
dtype: float64

In [39]:
# 열 합계
df.sum(axis=1)

0    270
1    185
2    200
3    235
dtype: int64

In [40]:
# 열 평균
df.mean(axis=1)

0    90.000000
1    61.666667
2    66.666667
3    78.333333
dtype: float64